# Lab05 Python Data Science with Pandas

## Please submit your finished lab05 jupyter notebook via pull request in GitHub

In [1]:
# magic command to display matplotlib plots inline within the ipython notebook webpage
%matplotlib inline

# import necessary modules
import pandas as pd, numpy as np, matplotlib.pyplot as plt

## Part 1 <br /> Basics of Selecting and Slicing Data

In [3]:
# create a pandas dataframe from the location data set
df = pd.read_csv(r'C:/Users/Xingyi/Desktop/PTUA/PTUA2024/Lab05/summer-travel-gps-full.csv')
df.head()

         lat       lon              date          city         country
0  51.481292 -0.451011  05/14/2014 09:07  West Drayton  United Kingdom
1  51.474005 -0.450999  05/14/2014 09:22      Hounslow  United Kingdom
2  51.478199 -0.446081  05/14/2014 10:51      Hounslow  United Kingdom
3  51.478199 -0.446081  05/14/2014 11:24      Hounslow  United Kingdom
4  51.474146 -0.451562  05/14/2014 11:38      Hounslow  United Kingdom

In [7]:
# Q1: how to get 2 columns from the dataframe (city and country)?
data = df[['country', 'city']]
data

             country          city
0     United Kingdom  West Drayton
1     United Kingdom      Hounslow
2     United Kingdom      Hounslow
3     United Kingdom      Hounslow
4     United Kingdom      Hounslow
...              ...           ...
1754         Germany        Munich
1755         Germany        Munich
1756         Germany        Munich
1757         Germany        Munich
1758         Germany        Munich

[1759 rows x 2 columns]

To get a single "cell's" value out of a dataframe, pass a column name, then a row label. This is equivalent to slicing the dataframe down to a single series, then slicing a single value out of that series using [ ] indexing.

In [8]:
# Q2: how to get the first 5 rows of the "city" column?
data.head(5)

          country          city
0  United Kingdom  West Drayton
1  United Kingdom      Hounslow
2  United Kingdom      Hounslow
3  United Kingdom      Hounslow
4  United Kingdom      Hounslow

### Using .loc[ ]

In [18]:
# Q3: how to use .loc to select the third row of the dataframe?
data[1:4]

          country      city
1  United Kingdom  Hounslow
2  United Kingdom  Hounslow
3  United Kingdom  Hounslow

In [13]:
# Q4: how to use .loc to select the first row in "country" column?
data['country'][2]

'United Kingdom'

In [15]:
# Q5: how to select the first 4 rows of ['city', 'date'] columns?
city_data = df[['city','date']]
city_data.head(5)

           city              date
0  West Drayton  05/14/2014 09:07
1      Hounslow  05/14/2014 09:22
2      Hounslow  05/14/2014 10:51
3      Hounslow  05/14/2014 11:24
4      Hounslow  05/14/2014 11:38

### Using .iloc[ ]

In [20]:
# use .iloc for integer position based indexing
# Q6: how to get the value from the row in position 3 and the column in position 2
ps = pd.DataFrame(data)
value = df.iloc[2, 1]
print("Value at row 3, column 2:", value)

Value at row 3, column 2: -0.446081

In [22]:
# Q7: how to use iloc to select every 300th row from a data set
selected_rows = data.iloc[[300]]
selected_rows

    country       city
300   Spain  Barcelona

## Part 2 <br /> How to select rows by some value(s)

In [23]:
# load a reduced set of gps data
df = pd.read_csv('C:/Users/Xingyi/Desktop/PTUA/PTUA2024/Lab05/summer-travel-gps-simplified.csv')
df.tail()

           lat        lon              date      city  country
173  41.044556  28.983286  07/08/2014 16:44  Istanbul   Turkey
174  41.008992  28.968268  07/08/2014 20:03  Istanbul   Turkey
175  41.043487  28.985488  07/08/2014 22:18  Istanbul   Turkey
176  40.977637  28.823879  07/09/2014 09:03  Istanbul   Turkey
177  48.357110  11.791346  07/09/2014 13:20    Munich  Germany

In [88]:
# Q9: create a Series of true/false, indicating if each "city" row in the column is equal to "Munich"
# Create a boolean Series where values are True if they are equal to "Munich", and False otherwise
condition_series = df['city'] == 'Munich'

# Print the DataFrame and the boolean Series
print(condition_series)

date
2014-05-14 09:07:00    False
2014-05-14 09:22:00    False
2014-05-14 10:51:00    False
2014-05-14 11:24:00    False
2014-05-14 11:38:00    False
                       ...
2014-07-09 13:13:00     True
2014-07-09 13:14:00     True
2014-07-09 13:17:00     True
2014-07-09 13:18:00     True
2014-07-09 13:20:00     True
Name: city, Length: 1759, dtype: bool

In [104]:
# pandas logical operators are: | for or, & for and, ~ for not
# these must be grouped by using parentheses
# Q10: what cities were visited in spain that were not barcelona? Create a dataframe for it. 
non_barcelona_df = df[(df['country'] == 'Spain') & (df['city'] != 'Barcelona')]
print(non_barcelona_df)

                           lat       lon                     city country
date
2014-05-18 22:35:00  41.303911  2.105931     El Prat de Llobregat   Spain
2014-05-18 22:49:00  41.292723  2.075583               Viladecans   Spain
2014-05-18 23:04:00  41.289946  2.064590               Viladecans   Spain
2014-05-18 23:20:00  41.294143  2.073177               Viladecans   Spain
2014-05-18 23:34:00  41.320125  2.090935     El Prat de Llobregat   Spain
2014-06-12 17:19:00  41.306752  2.097624     El Prat de Llobregat   Spain
2014-06-12 17:35:00  41.312086  2.077921     El Prat de Llobregat   Spain
2014-06-12 17:49:00  41.304333  2.072728     El Prat de Llobregat   Spain
2014-06-12 18:04:00  41.354599  2.122235  Hospitalet de Llobregat   Spain
2014-06-13 11:05:00  41.359580  2.128153  Hospitalet de Llobregat   Spain
2014-06-13 11:19:00  41.359702  2.130125  Hospitalet de Llobregat   Spain
2014-06-13 11:35:00  41.358460  2.128701  Hospitalet de Llobregat   Spain
2014-06-20 22:15:00  41.294761  2.059722               Viladecans   Spain
2014-06-20 23:14:00  41.304421  2.062938     El Prat de Llobregat   Spain

In [108]:
# Q11: select rows where either the city is munich, or the country is serbia
munich_df = df[(df['country'] == 'Serbia') | (df['city'] == 'Munich')]
print(munich_df)

                           lat        lon       city  country
date
2014-06-21 01:59:00  44.821164  20.289821   Belgrade   Serbia
2014-06-21 02:29:00  44.814263  20.463396   Belgrade   Serbia
2014-06-21 04:29:00  44.814237  20.463395   Belgrade   Serbia
2014-06-21 05:30:00  44.814260  20.463441   Belgrade   Serbia
2014-06-21 08:00:00  44.814255  20.463413   Belgrade   Serbia
2014-06-21 10:14:00  44.814763  20.462994   Belgrade   Serbia
2014-06-21 13:29:00  44.814257  20.463436   Belgrade   Serbia
2014-06-21 13:45:00  44.814246  20.463423   Belgrade   Serbia
2014-06-21 15:29:00  44.814242  20.463396   Belgrade   Serbia
2014-06-21 17:29:00  44.817690  20.464091   Belgrade   Serbia
2014-06-21 18:44:00  44.820414  20.463465   Belgrade   Serbia
2014-06-21 19:30:00  44.814251  20.463413   Belgrade   Serbia
2014-06-21 22:14:00  44.814237  20.463392   Belgrade   Serbia
2014-06-22 05:14:00  44.814209  20.463401   Belgrade   Serbia
2014-06-22 07:58:00  44.761583  19.577904  Slepčević   Serbia
2014-07-09 13:11:00  48.356417  11.792155     Munich  Germany
2014-07-09 13:13:00  48.356013  11.791710     Munich  Germany
2014-07-09 13:14:00  48.356529  11.792183     Munich  Germany
2014-07-09 13:17:00  48.356285  11.791710     Munich  Germany
2014-07-09 13:18:00  48.355328  11.791710     Munich  Germany
2014-07-09 13:20:00  48.357110  11.791346     Munich  Germany

In [110]:
# Q12: how many observations are west of the prime meridian?
west_of_prime_meridian_count = df[df['lon'] < 0].shape[0] 
#df['lon'] < 0 creates a boolean Series where each element is True if the corresponding longitude value is west of the prime meridian (negative) and False otherwise. The resulting boolean Series is then used to filter the DataFrame, and shape[0] is used to get the count of rows.

# Print the count
print(west_of_prime_meridian_count)

263

In [111]:
# Q13: get all rows that contain a city that starts with the letter G
# Filter rows where the "city" starts with the letter 'G'
cities_starting_with_g_df = df[df['city'].str.startswith('G')]

# Print the resulting DataFrame
print(cities_starting_with_g_df)

                           lat        lon         city  country
date
2014-06-02 06:39:00  50.273632  18.729429      Gliwice   Poland
2014-06-02 06:55:00  50.273632  18.729429      Gliwice   Poland
2014-06-10 13:33:00  48.282940   8.199630       Gutach  Germany
2014-06-10 13:48:00  48.389029   8.021342   Gengenbach  Germany
2014-07-04 17:39:00  40.187827  20.079304  Gjirokastër  Albania
2014-07-04 17:42:00  40.187825  20.079303  Gjirokastër  Albania

In [117]:
# Q14: how many unique cities and countries in the dataset? 
unique_cities = df.city.unique()
print("unique cities",unique_cities)

unique_countries = df.country.unique()
print("unique country",unique_countries)

# Also can you check missing values for the dataframe
df.isnull().sum()

unique cities ['West Drayton' 'Hounslow' 'Lisbon' 'Amadora' 'Algueirão-Mem Martins'
 'Sintra' 'Damaia' 'Azambuja' 'Santarém' 'Zibreira' 'Ourém Municipality'
 'São Mamede' 'Leiria District' 'Coimbra Municipality' 'Aveiro District'
 'Vila Nova de Gaia' 'Porto' 'Vila Nova de Gaia Municipality'
 'Porto District' 'Maia Municipality' 'Matosinhos' 'Maia'
 'El Prat de Llobregat' 'Viladecans' 'Barcelona' 'Zendek'
 'Tarnowskie Góry County' 'Silesian Voivodeship' 'Dabrowa Gornicza'
 'Olkusz County' 'Krakow' 'Kraków-Śródmieście' 'Oswiecim'
 'Babice, Oświęcim County' 'Wygiełzów, Lesser Poland Voivodeship'
 'Chrzanów County' 'Wieliczka' 'Balice, Lesser Poland Voivodeship'
 'Trzebinia' 'Imielin' 'Ruda Slaska' 'Gliwice' 'Bytom' 'Novy Bohumin'
 'Ostrava' 'Suchdol nad Odrou' 'Hranice' 'Prerov' 'Ústí nad Orlicí'
 'Kojice' 'Sadská' 'Prague' 'Úvaly' 'Poříčany' 'Kolin' 'Kutna Hora'
 'Nové Dvory (Kutná Hora District)' 'Český Brod' 'Beroun' 'Mýto' 'Plzen'
 'Blatnice' 'Kostelec' 'Rozvadov' 'Kümmersbruck' 'Winkelhaid'
 'Kammerstein' 'Ansbach' 'Ellhofen' 'Obersulm' 'Stuttgart' 'Wernau'
 'Riederich' 'Kirchentellinsfurt' 'Tübingen' 'Rottenburg' 'Horb am Neckar'
 'Eutingen im Gäu' 'Schopfloch' 'Freudenstadt' 'Alpirsbach' 'Wolfach'
 'Gutach' 'Gengenbach' 'Offenburg' 'Friesenheim' 'Freiburg' 'Kirchzarten'
 'Titisee-Neustadt' 'Villingen-Schwenningen' 'Dietingen'
 'Leinfelden-Echterdingen' 'Hospitalet de Llobregat' 'Belgrade'
 'Slepčević' 'Sarajevo' 'Mostar' 'Ploče' 'Split'
 'Herzegovina-Neretva Canton' 'Dubrovnik' 'Kotor' 'Prizren' 'Ohrid'
 'Berat' 'Gjirokastër' 'Kakavia' 'Dytiki Ellada' 'Peloponnese' 'Athens'
 'Attica' 'Istanbul' 'Munich']
unique country ['United Kingdom' 'Portugal' 'Spain' 'Poland' 'Czech Republic' 'Germany'
 'Serbia' 'Bosnia and Herzegovina' 'Croatia' 'Montenegro' 'Kosovo'
 'Macedonia (FYROM)' 'Albania' 'Greece' 'Turkey']

lat        0
lon        0
city       0
country    0
dtype: int64

In [122]:
# Q15: group by country name and show the city names in each of the country
grouped_df = df.groupby('country')['city'].agg(list).reset_index()
print(grouped_df)

# question here: What should I do if I don't want to show the city repeatedly, only shows the cities once inside the braket

                   country                                               city
0                  Albania  [Berat, Berat, Berat, Berat, Berat, Berat, Ber...
1   Bosnia and Herzegovina  [Sarajevo, Sarajevo, Sarajevo, Sarajevo, Saraj...
2                  Croatia  [Ploče, Split, Split, Split, Split, Split, Spl...
3           Czech Republic  [Novy Bohumin, Ostrava, Suchdol nad Odrou, Hra...
4                  Germany  [Kümmersbruck, Winkelhaid, Kammerstein, Ansbac...
5                   Greece  [Kakavia, Dytiki Ellada, Dytiki Ellada, Dytiki...
6                   Kosovo  [Prizren, Prizren, Prizren, Prizren, Prizren, ...
7        Macedonia (FYROM)  [Ohrid, Ohrid, Ohrid, Ohrid, Ohrid, Ohrid, Ohr...
8               Montenegro  [Kotor, Kotor, Kotor, Kotor, Kotor, Kotor, Kot...
9                   Poland  [Zendek, Tarnowskie Góry County, Silesian Voiv...
10                Portugal  [Lisbon, Lisbon, Lisbon, Lisbon, Lisbon, Lisbo...
11                  Serbia  [Belgrade, Belgrade, Belgrade, Belgrade, Belgr...
12                   Spain  [El Prat de Llobregat, Viladecans, Viladecans,...
13                  Turkey  [Istanbul, Istanbul, Istanbul, Istanbul, Istan...
14          United Kingdom  [West Drayton, Hounslow, Hounslow, Hounslow, H...

## Part 3 <br /> How to select based on a date-time values

In [62]:
# load the location data set, indexed by the date field
# and, parse the dates so they're no longer strings but now rather Python datetime objects
# this lets us do date and time based operations on the data set
dt = pd.read_csv('C:/Users/Xingyi/Desktop/PTUA/PTUA2024/Lab05/summer-travel-gps-full.csv', index_col='date', parse_dates=True)
dt.head()

                           lat       lon          city         country
date
2014-05-14 09:07:00  51.481292 -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005 -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199 -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146 -0.451562      Hounslow  United Kingdom

In [66]:
# Q16: is the timestamp index unique? How can you use code to find it? 
is_unique = dt.index.is_unique
is_unique

False

In [ ]:
# Q17: drop duplicate index 
# check if there are duplicates
has_duplicates = dt.index.duplicated().any()

# Print the DataFrame before dropping duplicates
print(dt)

# Drop rows with duplicate indices
dt_no_duplicates = dt[~dt.index.duplicated(keep='first')]

# Print the DataFrame after dropping duplicates
print(dt_no_duplicates)

In [70]:
# Q18: create a weekday and a weekend dataframe
weekday_df = df[df.index.weekday < 5]  # Monday to Friday (0 to 4)
weekend_df = df[df.index.weekday >= 5]  # Saturday and Sunday (5 and 6)

# Print the DataFrames
print("Weekday DataFrame:")
print(weekday_df)

print("Weekend DataFrame:")
print(weekend_df)

Weekday DataFrame:
                           lat        lon          city         country
date
2014-05-14 09:07:00  51.481292  -0.451011  West Drayton  United Kingdom
2014-05-14 09:22:00  51.474005  -0.450999      Hounslow  United Kingdom
2014-05-14 10:51:00  51.478199  -0.446081      Hounslow  United Kingdom
2014-05-14 11:24:00  51.478199  -0.446081      Hounslow  United Kingdom
2014-05-14 11:38:00  51.474146  -0.451562      Hounslow  United Kingdom
...                        ...        ...           ...             ...
2014-07-09 13:13:00  48.356013  11.791710        Munich         Germany
2014-07-09 13:14:00  48.356529  11.792183        Munich         Germany
2014-07-09 13:17:00  48.356285  11.791710        Munich         Germany
2014-07-09 13:18:00  48.355328  11.791710        Munich         Germany
2014-07-09 13:20:00  48.357110  11.791346        Munich         Germany

[1245 rows x 4 columns]
Weekend DataFrame:
                           lat        lon      city   country
date
2014-05-17 00:09:00  38.711824  -9.137308    Lisbon  Portugal
2014-05-17 00:39:00  38.711833  -9.137317    Lisbon  Portugal
2014-05-17 01:09:00  38.711822  -9.137277    Lisbon  Portugal
2014-05-17 01:39:00  38.711823  -9.137273    Lisbon  Portugal
2014-05-17 01:54:00  38.711828  -9.137279    Lisbon  Portugal
...                        ...        ...       ...       ...
2014-07-06 22:12:00  41.040212  28.988639  Istanbul    Turkey
2014-07-06 22:27:00  41.043491  28.985364  Istanbul    Turkey
2014-07-06 23:12:00  41.043476  28.985419  Istanbul    Turkey
2014-07-06 23:23:00  41.043494  28.985460  Istanbul    Turkey
2014-07-06 23:37:00  41.043492  28.985446  Istanbul    Turkey

[514 rows x 4 columns]

In [124]:
# Q19: calculate and plot the number of observations each day of the week has
# Calculate the number of observations for each day of the week
df['day_of_week'] = df.index.day_name()
obs_per_day = df['day_of_week'].value_counts()

# Plot the number of observations per day of the week
ps.plot(figsize=(10, 6), title='Number of Observations Each Day of the Week'),
plt.xlabel('Day of the Week')
plt.ylabel('Number of Observations') 
plt.show()

# question: I have no idea how to do this one

TypeError: no numeric data to plot